a = b = 2  		# Пример множественного оператора присваивания.
# Обратите внимание на значения переменных a и b после выполнения данной операции.

print("a = " + str(a))   #  Функция str() используется для приведения типа аргумента к строковому

print("b = " + "str(b)")


hello = "Привет"

print("hello = " + str(hello))

hello = "Hello" # Переопределите значение переменной hello

print("hello = " + str(hello))

# Создайте ещё несколько переменных, а затем осуществите их вывод через пробел
age = 18
name = "Name"
surname = "Surname"

print(age, name, surname)